# YOLOv5-Improved Model Configuration (Nano scale)
# Features: C3_DSConv backbone, SimAM & CoordAtt attention, CARAFE upsampling, and Decoupled Detect head.

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5-Improved Backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3_DSConv, [128]],   # 2
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3_DSConv, [256]],   # 4
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3_DSConv, [512]],   # 6
   [-1, 1, SimAM, []],          # 7-无参注意力特征保护层
   [-1, 1, SPPF, [1024, 5]],    # 8
  ]

# YOLOv5-Improved Head (Neck + Decoupled Detect Head)
head:
  [[-1, 1, Conv, [256, 1, 1]],
   [-1, 1, CARAFE, [2]],        # 10-自适应内容感知上采样
   [[-1, 6], 1, Concat, [1]],   # cat backbone P4
   [-1, 3, C3, [256, False]],   # 12

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, CARAFE, [2]],        # 14-自适应内容感知上采样
   [[-1, 4], 1, Concat, [1]],   # cat backbone P3
   [-1, 3, C3, [128, False]],   # 16 (P3/8-small)

   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 12], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [256, False]],   # 19 (P4/16-medium)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 9], 1, Concat, [1]],   # cat head P5
   [-1, 3, C3, [512, False]],   # 22 (P5/32-large)

   [[16, 19, 22], 1, Decoupled_Detect, [nc, anchors]],  # 23-解耦检测头替代普通头
  ]
